In [1]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [4]:
Names = pd.Series(['Ali','Mhsin','Ahmad'],index=[1,2,3])

In [5]:
Names

1      Ali
2    Mhsin
3    Ahmad
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [6]:
Names.index=[11,12,13]

In [7]:
Names

11      Ali
12    Mhsin
13    Ahmad
dtype: object

## Q3: Retrieve First and second elements.

In [8]:
Names[0:2]

11      Ali
12    Mhsin
dtype: object

## Q4: Add duplicate elements, then remove the duplication.

In [9]:
Names[14]='Mhsin'
Names

11      Ali
12    Mhsin
13    Ahmad
14    Mhsin
dtype: object

In [11]:
Names.drop_duplicates(inplace=True)

In [12]:
Names

11      Ali
12    Mhsin
13    Ahmad
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name, GPA).

In [18]:
Students = {'ID':[Names.index[0],Names.index[1],Names.index[2]],
             'Name':[Names.iloc[0],Names.iloc[1],Names.iloc[2]],
             'GPA':[4.63,4.51,4.52]}
df = pd.DataFrame(Students)
df

   ID   Name   GPA
0  11    Ali  4.63
1  12  Mhsin  4.51
2  13  Ahmad  4.52

## Q6: Read educ_figdp_1_Data.csv file and print the head.

In [20]:
educ = pd.read_csv('educ_figdp_1_Data.csv')
educ.head()

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e

## Q7: Give an example shows the difference between loc and slicing?
**Note:**
- loc use the index labels as references.
- slice use the position as references.

In [30]:
educ.loc[0:5,['TIME','GEO']]

   TIME                            GEO
0  2000  European Union (28 countries)
1  2001  European Union (28 countries)
2  2002  European Union (28 countries)
3  2003  European Union (28 countries)
4  2004  European Union (28 countries)
5  2005  European Union (28 countries)

In [24]:
educ[0:5]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e

- As we see, loc retrieves the end position inclusive, and slicing retrieves the end position exclusive. Also, the loc function can select specific columns to retrieve.

In [47]:
df

   index  ID   Name   GPA
0     11  11    Ali  4.63
1     22  12  Mhsin  4.51
2     33  13  Ahmad  4.52

In [48]:
df.index=[11,22,33]

In [49]:
df

    index  ID   Name   GPA
11     11  11    Ali  4.63
22     22  12  Mhsin  4.51
33     33  13  Ahmad  4.52

### loc function works on index labels

In [36]:
#loc with position
df.loc[0:2]

Empty DataFrame
Columns: [ID, Name, GPA]
Index: []

In [39]:
#loc with index labels
df.loc[11:33]

    ID   Name   GPA
11  11    Ali  4.63
22  12  Mhsin  4.51
33  13  Ahmad  4.52

### Slicing works on positions

In [40]:
#slicing with position
df[0:3]

    ID   Name   GPA
11  11    Ali  4.63
22  12  Mhsin  4.51
33  13  Ahmad  4.52

In [41]:
#Slicing with index labels
df[11:33]

Empty DataFrame
Columns: [ID, Name, GPA]
Index: []